{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "relu", "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 3], "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_5"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_6"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_3"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "units": 512, "use_bias": true, "kernel_constraint": null, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "seed": null, "name": "dropout_5", "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null, "units": 1, "use_bias": true, "kernel_constraint": null, "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_3"}}, "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "sample_weight_mode": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "RMSprop", "config": {"rho": 0.8999999761581421, "lr": 0.0010000000474974513, "epsilon": 1e-07, "decay": 0.0}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_10/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [2304, 512], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [1], "dtype": "float32"}]}]}